docs/testing/2026-09-09/database-load/database-c1.txt
pgbench (18.6)
transaction type: /tmp/scientific-search-read.sql
scaling factor: 1
query mode: prepared
number of clients: 1
number of threads: 1
maximum number of tries: 1
duration: 10 s
number of transactions actually processed: 246
number of failed transactions: 0 (0.000%)
latency average = 40.694 ms
initial connection time = 5.270 ms
tps = 24.573456 (without initial connection time)
statement latencies in milliseconds and failures:
        40.692           0 SELECT si.page_id, SUM(si.ranking) AS relevance