docs/testing/2026-09-09/database-load/database-c10.txt
pgbench (18.6)
transaction type: /tmp/scientific-search-read.sql
scaling factor: 1
query mode: prepared
number of clients: 10
number of threads: 10
maximum number of tries: 1
duration: 10 s
number of transactions actually processed: 1020
number of failed transactions: 0 (0.000%)
latency average = 98.592 ms
initial connection time = 10.093 ms
tps = 101.428370 (without initial connection time)
statement latencies in milliseconds and failures:
        98.313           0 SELECT si.page_id, SUM(si.ranking) AS relevance