docs/testing/2026-09-09/database-load/database-c5.txt
pgbench (18.6)
transaction type: /tmp/scientific-search-read.sql
scaling factor: 1
query mode: prepared
number of clients: 5
number of threads: 5
maximum number of tries: 1
duration: 10 s
number of transactions actually processed: 944
number of failed transactions: 0 (0.000%)
latency average = 53.163 ms
initial connection time = 6.671 ms
tps = 94.051258 (without initial connection time)
statement latencies in milliseconds and failures:
        53.064           0 SELECT si.page_id, SUM(si.ranking) AS relevance